main.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-16 Sun 13:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Main</title>
<meta name="author" content="Reflektoin" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Main</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org55bde85">1. Description</a></li>
<li><a href="#orgbfa62c5">2. Stylesheets</a></li>
<li><a href="#orgaa7b8ea">3. Javascript</a></li>
</ul>
</div>
</div>


<div id="outline-container-org55bde85" class="outline-2">
<h2 id="org55bde85"><span class="section-number-2">1.</span> Description</h2>
<div class="outline-text-2" id="text-1">
<p>
This is the main file where index.html file is created and other pages are referred to.
</p>

<p>
The html document starts with definining the document type as html.
</p>
<div class="org-src-container">
<pre class="src src-html" id="orgd18d555">&lt;<span style="color: #51afef;">!DOCTYPE</span> html&gt;
</pre>
</div>

<p>
Then we&rsquo;ll tell that content is in english with the &ldquo;lang&rdquo; attribute.
</p>
<div class="org-src-container">
<pre class="src src-html" id="org6af1967">&lt;<span style="color: #c678dd;">html</span> <span style="color: #dcaeea;">lang</span>=<span style="color: #98be65;">"en"</span>&gt;
</pre>
</div>

<p>
We&rsquo;ll open the head element.
</p>
<div class="org-src-container">
<pre class="src src-html" id="org3c09c7a">
&lt;<span style="color: #c678dd;">head</span>&gt;
</pre>
</div>

<p>
We&rsquo;ll define the character encoding and additional information.
</p>
<div class="org-src-container">
<pre class="src src-html" id="org7ed0711">    &lt;<span style="color: #c678dd;">meta</span> <span style="color: #dcaeea;">charset</span>=<span style="color: #98be65;">"UTF-8"</span>&gt;
    &lt;<span style="color: #c678dd;">meta</span> <span style="color: #dcaeea;">http-equiv</span>=<span style="color: #98be65;">"X-UA-Compatible"</span> <span style="color: #dcaeea;">content</span>=<span style="color: #98be65;">"IE=edge"</span>&gt;
    &lt;<span style="color: #c678dd;">meta</span> <span style="color: #dcaeea;">name</span>=<span style="color: #98be65;">"viewport"</span> <span style="color: #dcaeea;">content</span>=<span style="color: #98be65;">"width=device-width, initial-scale=1.0"</span>&gt;
</pre>
</div>

<p>
Next we&rsquo;ll add reference to the cascading style sheets file. We&rsquo;ll create the actual CSS(Cascading Style Sheets) file, named style.css, later.
</p>
<div class="org-src-container">
<pre class="src src-html" id="orge03b2c4">    &lt;<span style="color: #c678dd;">link</span> <span style="color: #dcaeea;">rel</span>=<span style="color: #98be65;">"stylesheet"</span> <span style="color: #dcaeea;">href</span>=<span style="color: #98be65;">"style.css"</span>&gt;
</pre>
</div>

<p>
Next we begin title of the page. This will be shown on the page&rsquo;s tab and on the browsers title bar.
</p>
<div class="org-src-container">
<pre class="src src-html" id="org5ef688f">    &lt;<span style="color: #c678dd;">title</span>&gt;<span style="font-weight: bold; text-decoration: underline;">Deutsch &#252;ben</span>&lt;/<span style="color: #c678dd;">title</span>&gt;
</pre>
</div>

<p>
Then we close the head element.
</p>
<div class="org-src-container">
<pre class="src src-html" id="org390657c">&lt;/<span style="color: #c678dd;">head</span>&gt;
</pre>
</div>

<p>
Next we&rsquo;ll start defining the body element. The contents of the web page will be here.
</p>
<div class="org-src-container">
<pre class="src src-html" id="orgd5b85ea">
&lt;<span style="color: #c678dd;">body</span>&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-html" id="orgfa6d395">    &lt;<span style="color: #c678dd;">h1</span>&gt;<span style="font-weight: bold; text-decoration: underline;">Kleinigkeiten zum Deutsch &#252;ben</span>&lt;/<span style="color: #c678dd;">h1</span>&gt;
</pre>
</div>

<p>
Let&rsquo;s create a unordered list which will contain different pages to practice German.
</p>

<div class="org-src-container">
<pre class="src src-html" id="orgc722140">    &lt;<span style="color: #c678dd;">div</span> <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"container"</span>&gt;

        &lt;<span style="color: #c678dd;">ul</span>&gt;
</pre>
</div>

<p>
We&rsquo;ll add a link to index.html file located in folder nummernHoeren. The file nummernHoeren/index.html is created from file <a href="./nummernHoeren/all.html">./nummernHoeren/all.html</a>
</p>
<div class="org-src-container">
<pre class="src src-html" id="orga763486">            &lt;<span style="color: #c678dd;">a</span> <span style="color: #dcaeea;">href</span>=<span style="color: #98be65;">"./nummernHoeren/index.html"</span>&gt;&#220;ben Nummern h&#246;ren&lt;/<span style="color: #c678dd;">a</span>&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-html" id="org001d4d3">        &lt;/<span style="color: #c678dd;">ul</span>&gt;

    &lt;/<span style="color: #c678dd;">div</span>&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-html" id="org0445acd">&lt;/<span style="color: #c678dd;">body</span>&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-html" id="org8a4f339">
&lt;/<span style="color: #c678dd;">html</span>&gt;
</pre>
</div>
</div>
</div>



<div id="outline-container-orgbfa62c5" class="outline-2">
<h2 id="orgbfa62c5"><span class="section-number-2">2.</span> Stylesheets</h2>
<div class="outline-text-2" id="text-2">
<p>
Next we&rsquo;ll create a css file called style.css
</p>

<div class="org-src-container">
<pre class="src src-css" id="org86b115f">
</pre>
</div>


<div class="org-src-container">
<pre class="src src-css"><span style="color: #c678dd;">@import</span> url(<span style="color: #98be65;">'https://fonts.googleapis.com/css2?family=Roboto:wght@400;700&amp;display=swap'</span>);

<span style="color: #51afef;">* </span>{
  <span style="color: #98be65;">box-sizing</span>: border-box;
}

<span style="color: #51afef;">body </span>{
    <span style="color: #98be65;">font-family</span>: <span style="color: #98be65;">'Roboto'</span>, sans-serif;
    <span style="color: #98be65;">display</span>: flex;
    <span style="color: #98be65;">flex-direction</span>: column;
    <span style="color: #98be65;">align-items</span>: center;
    <span style="color: #98be65;">justify-content</span>: center;
    <span style="color: #98be65;">height</span>: 100vh;
    <span style="color: #98be65;">overflow</span>: hidden;
    <span style="color: #98be65;">margin</span>: <span style="color: #da8548; font-weight: bold;">0</span>;
}

<span style="color: #51afef;">.container </span>{
    <span style="color: #98be65;">padding</span>: 20px;
    <span style="color: #98be65;">width</span>: <span style="color: #da8548; font-weight: bold;">30</span>%;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaa7b8ea" class="outline-2">
<h2 id="orgaa7b8ea"><span class="section-number-2">3.</span> Javascript</h2>
<div class="outline-text-2" id="text-3">
<p>
Lets create the Javascript file.
</p>

<div class="org-src-container">
<pre class="src src-javascript" id="orga49e8d4">
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Reflektoin</p>
<p class="date">Created: 2023-04-16 Sun 13:08</p>
</div>
</body>
</html>